## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/244e2724-e551-4666-9d53-a354536bf6da).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpqt_i4b59/plan`

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # cloudflare_dns_record.renterd will be created
+   resource "cloudflare_dns_record" "renterd" {
+       comment_modified_on = (known after apply)
+       content             = (known after apply)
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "renterd.test-node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

  # cloudflare_dns_record.renterd_s3 will be created
+   resource "cloudflare_dns_record" "renterd_s3" {
+       comment_modified_on = (known after apply)
+       content             = (known after apply)
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "s3.renterd.test-node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (known after apply)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   mysql_endpoint      = (known after apply)
+   renterd_endpoint    = "renterd.test-node.testing.pinner.xyz"
+   renterd_s3_endpoint = "s3.renterd.test-node.testing.pinner.xyz"
+   service_states      = {
+       etcd    = "active"
+       mysql   = (known after apply)
+       renterd = (known after apply)
    }

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
